Ipsitakoley/tm4c129-canbus/sae-benchmark/timers.c

/*
 * Copyright (C) 2019, 2021 Regents of University of Colorado
 * Written by Gedare Bloom <gbloom@uccs.edu>
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions
 * are met:
 * 1. Redistributions of source code must retain the above copyright
 *    notice, this list of conditions and the following disclaimer.
 * 2. Redistributions in binary form must reproduce the above copyright
 *    notice, this list of conditions and the following disclaimer in the
 *    documentation and/or other materials provided with the distribution.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
 * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
 * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
 * ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT OWNER OR CONTRIBUTORS BE
 * LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
 * CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
 * SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
 * INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
 * CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
 * ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
 * POSSIBILITY OF SUCH DAMAGE.
 */

#include <stdint.h>
#include <stdbool.h>
#include "inc/hw_can.h"
#include "inc/hw_ints.h"
#include "inc/hw_memmap.h"
#include "inc/hw_types.h"
#include "driverlib/debug.h"
#include "driverlib/fpu.h"
#include "driverlib/can.h"
#include "driverlib/gpio.h"
#include "driverlib/interrupt.h"
#include "driverlib/pin_map.h"
#include "driverlib/rom.h"
#include "driverlib/rom_map.h"
#include "driverlib/sysctl.h"
#include "driverlib/timer.h"
#include "driverlib/uart.h"
#include "utils/uartstdio.h"

#include "saebench.h"
#include "experiment.h"


//----------------------------------------------------------------------------
// Modify anything below with care!
//----------------------------------------------------------------------------

// System clock rate in Hz, set in main() to 120 MHz
uint32_t g_ui32SysClock;
#define SYSCLK (120000000)
#define TICKS_PER_MS (SYSCLK/1000)
#define TICKS_PER_US (TICKS_PER_MS/1000)
#define TICKS_PER_BIT (SYSCLK/BITRATE)
#define INTERVAL (TICKS_PER_MS*5)   // 5 ms in 120 MHz ticks
#define LATENCY_8B_MAX (129*TICKS_PER_BIT) /* maximum message latency */

// counters
volatile uint32_t g_ui32RXMsgCount = 0;
volatile uint32_t g_ui32TXMsgCount = 0;

// flags used by interrupt handlers
volatile uint32_t g_ui32ErrFlag = 0;
volatile bool g_bRXFlag = 0;
volatile bool g_bTXFlag = 0;
volatile bool g_bTXFlag_5 = 0;
volatile bool g_bTXFlag_10 = 0;
volatile bool g_bTXFlag_100 = 0;
volatile bool g_bTXFlag_1000 = 0;
volatile bool g_bTXTarget_1 = 0;
volatile bool g_bTXTarget_2 = 0;
volatile bool g_bRESETFlag = 0;
volatile bool g_tick = false;
volatile bool g_tick_2 = false;

/* Synchronization works on a simple state machine.
 * The initial state is SYNC_MODE_INIT. Transition goes from this state to SYNC_MODE RESET after some delay from start.
 * The reset state is SYNC_MODE_RESET. In this state, the attacker node attempts to resynchronize with the victim.
 * The adjustment state is SYNC_MODE_ADJUST. In this state, the attacker is resynchronizing to the victim by adjusting the periodic timers.
 * The synchronized state is SYNC_MODE_SYNCHED. This state is reached after the adjustment completes.
 */
#define SYNC_MODE_INIT       (0)
#define SYNC_MODE_SYNCHED    (1)
#define SYNC_MODE_RESYNCH    (2)    // UNUSED
#define SYNC_MODE_ADJUST     (3)
#define SYNC_MODE_RESET      (4)
volatile uint8_t g_sync = SYNC_MODE_INIT;

volatile bool g_reset = false;
volatile uint8_t g_msg_since_idle = 0;

// LED toggling states
volatile uint8_t g_pin0 = 0;
volatile uint8_t g_pin_2 = 0;

// keep track of interrupt event times
volatile uint32_t g_ui32LastCANIntTimer = 0;

// adds delay on reset
volatile uint32_t g_offset = 0;

// the (current) ID to attack
volatile uint32_t g_target_id = 0;
volatile uint32_t g_ui32TargetXmitTime = 0;
volatile uint8_t g_skip_attack = SKIP_ATTACK;

#define RXOBJECT_RESET      14
#define TXOBJECT_RESET      RXOBJECT_RESET
#define TXOBJECT_5          HIGHEST_TX_PRIORITY
#define TXOBJECT_Target_1   PRIORITY_Target_1
#define TXOBJECT_Target_2   PRIORITY_Target_2
#define TXOBJECT_RESERVED1  6
#define TXOBJECT_RESERVED2  7
#define TXOBJECT_10         9
#define TXOBJECT_100        11
#define TXOBJECT_RESERVED3  12
#define TXOBJECT_1000       13

#define RXOBJECT_RESERVED1  15
#define RXOBJECT            16


// The error routine that is called if the driver library encounters an error.
#ifdef DEBUG
void
__error__(char *pcFilename, uint32_t ui32Line)
{
}
#endif

void delay_us(uint32_t delay)
{
    uint32_t start = 0;
    uint32_t end = 1;
    // in case of an overflow.
    while (end >= start) { // loop in case of an overflow
        start = TimerValueGet(TIMER3_BASE, TIMER_A);
        end = start - delay*TICKS_PER_US; // timer3 is a free-running, countdown timer.
    }
    while (start > end) {
        start = TimerValueGet(TIMER3_BASE, TIMER_A);
    }
}

void delay_ms(uint32_t delay)
{
    delay_us(delay*1000);
}

void delay_ticks(uint32_t ticks)
{
    delay_us(ticks/TICKS_PER_US);
}

static inline void got_CAN_msg_interrupt(void)
{
    uint32_t timer_val;

    // This intends to count the number of messages since the last bus idle time.
    // TODO: It is a crude hack that may need tuning by changing the LATENCY definition.
    // A more clever solution would derive the expected timer value based on the length of
    // the received message, but we won't actually know that until (a) after that message is
    // received and (b) when the RX buffer is read in the main() busy-loop.
    if (g_ui32ExpCtrl & SYNC_0PHASE) {
        if (g_sync == SYNC_MODE_RESET) {
            timer_val = TimerValueGet(TIMER2_BASE, TIMER_A);
            if (g_target_id == TARGET_ID) {
                TimerLoadSet(TIMER2_BASE, TIMER_A, TARGET_XMIT_TIME);
            } else {
                TimerLoadSet(TIMER2_BASE, TIMER_A, TARGET_XMIT_TIME_2);
            }
            TimerEnable(TIMER2_BASE, TIMER_A);
            if (timer_val == 0) {
                g_msg_since_idle = 0;
            } else {
                g_msg_since_idle++;
            }
        }
    }

