Ipsitakoley/tm4c129-canbus/sae-benchmark/timers.c
    // TIMER2 is used for re-synchronization: 0-phase interval tracking and generating offsets during restart
    TimerConfigure(TIMER2_BASE, TIMER_CFG_ONE_SHOT);
    TimerLoadSet(TIMER2_BASE, TIMER_A, INTERVAL);
    IntEnable(INT_TIMER2A);
    TimerIntEnable(TIMER2_BASE, TIMER_TIMA_TIMEOUT);

    TimerConfigure(TIMER3_BASE, TIMER_CFG_PERIODIC);
    TimerLoadSet(TIMER3_BASE, TIMER_A, 0x10000000);

    if (g_ui32ExpCtrl & ATTACK_MASK) {
        g_target_id = TARGET_ID;
        g_ui32TargetXmitTime = TARGET_XMIT_TIME;
    }

    // Setup the CAN and UART
    InitCAN0();
    ConfigureUART2();
}

bool
do_switch(int count)
{
    uint32_t rec, tec;
    CANErrCntrGet(CAN0_BASE, &rec, &tec);
    if (rec + tec > 0) return false;

    UARTprintf("%d\tSWITCH\n", count);
    TimerIntDisable(TIMER2_BASE, TIMER_TIMA_TIMEOUT);
    g_target_id = TARGET_ID_2;
    g_ui32TargetXmitTime = TARGET_XMIT_TIME_2;
    g_sync = SYNC_MODE_RESET;
    if (g_ui32ExpCtrl & SYNC_0PHASE) {
        g_msg_since_idle = 10;
    }
    g_skip_attack = SKIP_ATTACK_2;
    return true;
}

void
got_message(int ID, bool is_RX)
{

}

int
main(void)
{
    int count = 0, count_2 = 0;
    volatile uint32_t delay = 0;
    uint32_t rec, tec;
    bool attack1_success = false, attack2_success = false;
    uint32_t last_target_rcv = 0;

    initialize();


    // Start the clocks
    TimerEnable(TIMER0_BASE, TIMER_A);
    // TimerEnable(TIMER1_BASE, TIMER_A);
    // TimerEnable(TIMER2_BASE, TIMER_A);
    TimerEnable(TIMER3_BASE, TIMER_A);

    // Whenever the "RESET" node reboots, reset everyone else.
#if defined(SEND_RESET)
    CANMessageSet(CAN0_BASE, TXOBJECT_RESET, &g_sCAN0TxMessage_RESET, MSG_OBJ_TYPE_TX);
#endif

    // main loop
    while(1) {
        if (g_bRESETFlag) {
            g_bRESETFlag = false;
            // this flag is set when this node transmitted the reset message
            do_reset(count, count_2, g_ui8TXMsgData_RESET[0]);
            count = count_2 = 0;
            last_target_rcv = 0;
        }

        if (g_tick == true) {
            g_tick = false;
            send_messages(++count);
        }

        if (g_tick_2 == true) {
            g_tick_2 = false;
         //   send_messages_2(++count_2);
        }

        if (g_bTXTarget_1) {
            g_bTXTarget_1 = false;
            if (g_ui32ExpCtrl & ATTACK_TRANSITIVE) {
                if (g_target_id == TARGET_ID) {
                    attack1_success = do_switch(count);
                } else {
                    if (PRECEDED_ID_2 == TARGET_ID) {
                        if (g_ui32ExpCtrl & DISABLE_RETRANS_RXPM) {
                            delay_ticks(RXPM_DELAY_BITS*TICKS_PER_BIT);
                            CANMessageClear(CAN0_BASE, TXOBJECT_Target_2);
                        }
                    }
                }
            }
            got_message(TARGET_ID, false);
            if (g_target_id == TARGET_ID) {
                CANErrCntrGet(CAN0_BASE, &rec, &tec);
                UARTprintf("%d\tATK1-TX %d\tREC\t%u\tTEC\t%u\n", count, TARGET_ID, rec, tec);
            }
        }

        if (g_bTXTarget_2) {
            g_bTXTarget_2 = false;
            got_message(TARGET_ID_2, false);
            CANErrCntrGet(CAN0_BASE, &rec, &tec);
            UARTprintf("%d\tATK2-TX %d\tREC\t%u\tTEC\t%u\n", count, TARGET_ID_2, rec, tec);
        }

        if (g_bTXFlag_5) {
            g_bTXFlag_5 = false;
            g_ui32TXMsgCount++;
            got_message(TX_5_ID, false);

            if (g_ui32ExpCtrl & DISABLE_RETRANS_RXPM) {
                if (PRECEDED_ID == HIGH_PRIO_ID) {
                    if ( g_target_id == TARGET_ID ) {
                        delay_ticks(RXPM_DELAY_BITS*TICKS_PER_BIT);
                        CANMessageClear(CAN0_BASE, TXOBJECT_Target_1);
                    }
                } else if (PRECEDED_ID_2 == HIGH_PRIO_ID) {
                    if ( g_target_id == TARGET_ID_2 ) {
                        delay_ticks(RXPM_DELAY_BITS*TICKS_PER_BIT);
                        CANMessageClear(CAN0_BASE, TXOBJECT_Target_2);
                    }
                } else {
                    // nothing to do.
                }
            }

#if defined(VERBOSE)
            CANErrCntrGet(CAN0_BASE, &rec, &tec);
            UARTprintf("%d\tTX\tREC\t%u\tTEC\t%u\n", count, rec, tec);
#endif
        }

        if (g_bTXFlag_10) {
            g_bTXFlag_10 = false;
            g_ui32TXMsgCount++;
            got_message(TX_10_ID, false);

#if defined(VERBOSE)
            CANErrCntrGet(CAN0_BASE, &rec, &tec);
            UARTprintf("%d\tTX\tREC\t%u\tTEC\t%u\n", count, rec, tec);
#endif
        }

        if (g_bTXFlag_100) {
            g_bTXFlag_100 = false;
            g_ui32TXMsgCount++;
            got_message(TX_100_ID, false);

#if defined(VERBOSE)
            CANErrCntrGet(CAN0_BASE, &rec, &tec);
            UARTprintf("%d\tTX\tREC\t%u\tTEC\t%u\n", count, rec, tec);
#endif
        }

        if (g_bTXFlag_1000) {
            g_bTXFlag_1000 = false;
            g_ui32TXMsgCount++;
            got_message(TX_1000_ID, false);

#if defined(VERBOSE)
            CANErrCntrGet(CAN0_BASE, &rec, &tec);
            UARTprintf("%d\tTX\tREC\t%u\tTEC\t%u\n", count, rec, tec);
#endif
        }

        if (g_bTXFlag) {
            g_bTXFlag = false;
            g_ui32TXMsgCount++;
            got_message(0, false);
#if defined(VERBOSE)
            CANErrCntrGet(CAN0_BASE, &rec, &tec);
            UARTprintf("%d\tTX\tREC\t%u\tTEC\t%u\n", count, rec, tec);
#endif
        }

        if (g_bRXFlag) {
            g_bRXFlag = false;
            uint32_t msg_id;

            // Read the message
            CANMessageGet(CAN0_BASE, RXOBJECT, &g_sCAN0RxMessage, 0);
            msg_id = g_sCAN0RxMessage.ui32MsgID;

            if(g_sCAN0RxMessage.ui32Flags & MSG_OBJ_DATA_LOST) {
#if defined(VERBOSE)
                //UARTprintf("%d\tCAN message loss detected\n", count);
#endif
            }

            if (msg_id == 0xFF) {
                // The ID 0x01 is used for RESET message.
                do_reset(count, count_2, g_ui8RXMsgData[0]);
                count = count_2 = 0;
                last_target_rcv = 0;
                continue;
            }

